Revit 2027 API
SpotDimension.Flip Method
 Flips dimension to the other side of the host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Flip()
Public Sub Flip
public:
void Flip()
member Flip : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  SpotDimension cannot be flipped.
See Also
Reference
SpotDimension Class
Autodesk.Revit.DB Namespace